#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/swdemo/kubernetes-ops-staging-helm-kube-prometheus-stack/runs/run-Kd7Ht8oKfAMgUcbW

Waiting for the plan to start...

Terraform v1.3.4
on linux_amd64
Initializing plugins and modules...
data.terraform_remote_state.route53_hosted_zone: Reading...
data.terraform_remote_state.eks: Reading...
data.aws_eks_cluster_auth.main: Reading...
data.aws_eks_cluster_auth.main: Read complete after 0s [id=staging]
data.terraform_remote_state.eks: Read complete after 0s
data.terraform_remote_state.route53_hosted_zone: Read complete after 1s

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.kube-prometheus-stack.helm_release.helm_chart will be created
  + resource "helm_release" "helm_chart" {
      + atomic                     = false
      + chart                      = "kube-prometheus-stack"
      + cleanup_on_fail            = false
      + create_namespace           = true
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "kube-prometheus-stack"
      + namespace                  = "monitoring"
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://prometheus-community.github.io/helm-charts"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + values                     = [
          + <<-EOT
                ---
                namespaceOverride: monitoring
                # prometheusOperator:
                #   nodeSelector:
                #     app-type: my-app
                #   tolerations:
                #   - key: "app-type"
                #     operator: "Equal"
                #     value: "my-app"
                #     effect: "NoSchedule"
                # prometheus:
                #   prometheusSpec:
                #     nodeSelector:
                #       app-type: my-app
                #     tolerations:
                #     - key: "app-type"
                #       operator: "Equal"
                #       value: "my-app"
                #       effect: "NoSchedule"
                # alertmanager:
                #   enabled: true
                  # alertmanagerSpec:
                  #   nodeSelector:
                  #     app-type: my-app
                  #   tolerations:
                  #   - key: "app-type"
                  #     operator: "Equal"
                  #     value: "my-app"
                  #     effect: "NoSchedule"
                # nodeExporter:
                  # nodeSelector:
                  #   app-type: my-app
                  # tolerations:
                  # - key: "app-type"
                  #   operator: "Equal"
                  #   value: "my-app"
                  #   effect: "NoSchedule"
                grafana:
                  adminPassword: prom-operator
                  ingress:
                    enabled: true
                    annotations:
                      kubernetes.io/ingress.class: ingress-external
                    hosts:
                    - grafana.kubernetes-ops.com
                  # nodeSelector:
                  #   app-type: my-app
                  # tolerations:
                  # - key: "app-type"
                  #   operator: "Equal"
                  #   value: "my-app"
                  #   effect: "NoSchedule"
            EOT,
          + <<-EOT
                ---
                namespaceOverride: monitoring
                prometheus:
                  prometheusSpec:
                    storageSpec:
                     volumeClaimTemplate:
                       spec:
                        #  storageClassName: gluster
                         accessModes: ["ReadWriteOnce"]
                         resources:
                           requests:
                             storage: 25Gi
                grafana:
                  adminPassword: prom-operator
                  ingress:
                    enabled: true
                    annotations:
                      cert-manager.io/cluster-issuer: "letsencrypt"
                      external-dns.alpha.kubernetes.io/hostname: "grafana.k8s.staging.swdemo.net"
                      kubernetes.io/ingress.class: nginx
                    hosts:
                    - grafana.k8s.staging.swdemo.net
                    tls:
                    - hosts:
                      - grafana.k8s.staging.swdemo.net # This should match a DNS name in the Certificate
                      secretName: tls-grafana # This should match the Certificate secretName
                  additionalDataSources:
                  - name: loki
                    access: proxy
                    basicAuth: false
                    basicAuthPassword: pass
                    basicAuthUser: daco
                    editable: false
                    jsonData:
                        tlsSkipVerify: true
                    orgId: 1
                    type: loki
                    url: http://loki-stack:3100
                    version: 1
            EOT,
        ]
      + verify                     = false
      + version                    = "14.5.0"
      + wait                       = true
      + wait_for_jobs              = false
    }

Plan: 1 to add, 0 to change, 0 to destroy.


```


</details>

*Pusher: @RajAlexander, Action: `pull_request`*